# linux commands

# ctrl+alt+t - команда для открытие терминала

# ~  символ домашней диретории
# / - символ корневой директории 

#  . - обозначает текущую директорию 
#  .. - обозначает предыдущую директорию 


#1. ls - команда для вывода всех диреторий(папка) и файлов в текущей(рабочей) директории в терминале
# 2. cd(chage directory) - команда для перехода из одной  диретории в другую
# 3. mkdir - создает диретории
# 4 touch - созадет файл

# 5 rmdir - удаляет пустую диреторию 

# 6 rm - удаляет файл 

# 7 rm -rf - удаляет вообще все(принудительное удаление)

# 8  ls-a - показывает скрытые и обычные файлы и директории

# ls-la - показывает подробную информацию 

# 9 pwd(print working directory) - выводит путь до текущей диретории 


# 10.*cp - копирует файл или директорию в указанное местоо 


# 11* mv -Перемещение файла.

# 12.cat- позволяет создавать и объединять содержимое файлов, а также считать данные в указанном файле и отображать их на экране монитора.

# 13. nano- водящая строку текста в терминал, обычно используется в скриптах для отображения сообщения или вывода результатов других команд.20


# 14 echo - команда для быстрой записи текста в файл 
# echo текст > файл 



