# /// TASK1 \\\
# Дан список целых чисел, найдите минимальное значение, не используя встренную функцию min()
# Например:
# list_ = [20, 10, 20, 1, 100]

# min_num = 100000000

# for i in list_:
#     if i < min_num:
#         min_num = i
# print(min_num)



# Результат:
# min_number = 1


# def find_mimimum(list):
#     list_ = [20, 10, 20, 1, 100]
#     return 
# res  = find_mimimum(list)
# print('minimum number',res)

# """ 2)'''Назовем число красивым, если оно является четырехзначным и делится нацело на 7 или на 17. Напишите программу, определяющую, является ли введённое число красивым. Программа должна вывести «YES», если число является красивым, или «NO» в противном случае.
# Формат входных данных
# На вход программе подаётся натуральное число.
# Формат выходных данных
# Программ

# """
# # # task 2 
# # num = int(input('enter the number four-digit' ))
# # if num % 7 ==0 and num %17 == 0 :
# #     print('number is beautiful')
# # else:
# #     print('number is not beautiful')



# # for number in range(1000, 10000):
# #     if number % 7 == 0 and number % 17 == 0:
# #         print("Four-digit number divisible by 7 and 17:", number)
# #         break  # Stop the loop after finding the first match


# # /// TASK2 \\\
# # Дан список с кортежами, выведите список без пустых кортежей
# # Например:
# # tuples = [(), ('ram','15','8'), (), ('laxman', 'sita')]
# # Результат:
# # cleared_tuples = [('ram','15','8'), ('laxman', 'sita')]

