# В этой программе мы сначала предлагаем пользователю ввести положительное целое число, используя функцию input(). Мы преобразуем входные данные в целое число с помощью функции int().

# Затем мы используем серию операторов if-elif-else, чтобы проверить значение n и выполнить соответствующее действие. Если n нечетное, мы печатаем «Weird». Если n четное и находится в диапазоне от 2 до 5, мы печатаем «Not Weird». Если n четное и находится в диапазоне от 6 до 20, мы печатаем «Weird». Если n четно и больше 20, мы печатаем «Not Weird».

# Эта программа охватывает заданные условия для n в диапазоне от 1 до 100.

# num = int(input('enter your number'))
# if num % 2 != 0:
#     print('Weird')
# elif num % 2 == 0 and 2 <= num <= 5:
#     print('Not Weird')
# elif num % 2 == 0 and 6 <= num <= 20:
#     print('Weird')
# elif num % 2 == 0 and num > 20:
#     print('Not Weird')

# my_dict2 = dict(key1='value1', key2='value2', key3='value3')
# my_dict2 = {
#     'brand': 'Ford',
#     'model': 'Mustang',
#     'year': 1967
# }
# print(my_dict2)


