# GIT - Распределенная система контроля верссий
 
# Это система для отслеживание и введение истории изиения файлов , в вашем  проекте. При помощи распределенности в git еще и организовывается командная работа.
 
# Репозиторий - это хранилище вашего кода и истории его  изменений 

#  Github - веб сайт для разммешение git -  репозиториев в совместной разрабоьке проектов

# Команды Git:
 
#1. git init - она создает новый локальный репозиторий, в той директории в который была прописана команда . (Команда вводится один раз в начале )
 
#2. git add - комнда для добавление изменений в систему отслеживание гита 

# 3.  git commit -m "<comment>" - команда для сохранение всех изменений в локальном репозитории с комментарием к ним 

# 4. git remote 

# 5. 